In [4]:
import numpy as np
import pandas as pd

# Data Frames

### Combination of multiple series ---> DataFrame

- Creating a dataframe
- Selection and indexing of columns
- Creating a new column
- Removing a  column
- Selecting rows
- Selecting subsets of rows and columns
- Conditional selections

#### Creating a DataFrame

In [15]:
i = ['MSSF001', 'MSSF002', 'MSSF003', 'MSSF004']
dataDict = {
    'Name': ['Talal', 'Ahmad', 'Faiqa', 'Ali'],
    'Age': [18, 19, 17, 21],
    'City': ['Lahore', 'Islamabad', 'Karachi', 'Peshawar'],
    'Salary': [170000, 65000, 82000, 115000]
}

# Creating a DataFrame using dictionary
df = pd.DataFrame(dataDict, index=i)
df

          Name  Age       City  Salary
MSSF001  Talal   18     Lahore  170000
MSSF002  Ahmad   19  Islamabad   65000
MSSF003  Faiqa   17    Karachi   82000
MSSF004    Ali   21   Peshawar  115000

In [6]:
i = ['MSSF001', 'MSSF002', 'MSSF003', 'MSSF004']
data = [
    ['Talal', 18, 'Lahore', 170000],
    ['Ahmad', 19, 'Islamabad', 65000],
    ['Faiqa', 17, 'Karachi', 82000],
    ['Ali', 21, 'Peshawar', 115000]
]

# Creating a DataFrame using List
Col = ['Name', 'Age' ,'City', 'Salary']
df2 = pd.DataFrame(data, index = i, columns = Col)
df2

          Name  Age       City  Salary
MSSF001  Talal   18     Lahore  170000
MSSF002  Ahmad   19  Islamabad   65000
MSSF003  Faiqa   17    Karachi   82000
MSSF004    Ali   21   Peshawar  115000

### Selecting and Indexing of columns

In [7]:
col1 = df['Age'] # for one column
print(col1)
col = df2[['Name', 'Salary']] # for more than one columns
print(col)

MSSF001    18
MSSF002    19
MSSF003    17
MSSF004    21
Name: Age, dtype: int64
          Name  Salary
MSSF001  Talal  170000
MSSF002  Ahmad   65000
MSSF003  Faiqa   82000
MSSF004    Ali  115000

### Creating a new column

In [17]:
# for creating a new column, dataframe_name['name_of_new_column'] = [values_equal_to_num_of_rows]

df['Designation'] = ['CyberPunk', 'Engineer', 'Doctor', 'Pilot'] # Here must 4 values, since rows are 4
df

          Name  Age       City  Salary Designation
MSSF001  Talal   18     Lahore  170000   CyberPunk
MSSF002  Ahmad   19  Islamabad   65000    Engineer
MSSF003  Faiqa   17    Karachi   82000      Doctor
MSSF004    Ali   21   Peshawar  115000       Pilot

### Removing a column

In [9]:
# To remove a created column

df2.drop('Age', axis = 1) # Just drop the column as a copy, original one remains same
df2  # Have 'Age' column

# For permanent drop of column...
df2.drop('Age', axis = 1, inplace = True) #Removed 'Age' in original also
df2

# For multiple drops
df.drop(['Name', 'Age', 'Designation'], axis = 1, inplace = True)

# For removing row
df2.drop('MSSF002', axis = 0)

# DEFAULT AXIS = 0

          Name      City  Salary
MSSF001  Talal    Lahore  170000
MSSF003  Faiqa   Karachi   82000
MSSF004    Ali  Peshawar  115000

### Selecting Rows

In [10]:
df
df.loc['MSSF002'] # .loc for a row selection

df.loc[['MSSF001', 'MSSF004']]  # Multiple

             City  Salary
MSSF001    Lahore  170000
MSSF004  Peshawar  115000

### Selecting Subset of Rows and Columns

In [18]:
# Just like a 2D selection
df
df.loc[['MSSF001', 'MSSF003']][['Age', 'Designation']]  # Selected rows and columns of my choice

df.loc['MSSF002']['Name']

'Ahmad'

### Conditional selection

In [ ]:
# Only those people which are above 18

df[df['Age'] > 18]

# Only those who live in peshawar and age is greater than 18
df[(df['Age'] > 18) & (df['City'] == 'Peshawar')]

        Name  Age      City  Salary Designation
MSSF004  Ali   21  Peshawar  115000       Pilot